### From SQL Server to Pandas DataFrame

In [1]:
import pandas as pd
import pyodbc

** Lets check the pyodbc module documentaion **

In [2]:
pyodbc.__doc__

"A database module for accessing databases via ODBC.\n\nThis module conforms to the DB API 2.0 specification while providing\nnon-standard convenience features.  Only standard Python data types are used\nso additional DLLs are not required.\n\nStatic Variables:\n\nversion\n  The module version string.  Official builds will have a version in the format\n  `major.minor.revision`, such as 2.1.7.  Beta versions will have -beta appended,\n  such as 2.1.8-beta03.  (This would be a build before the official 2.1.8 release.)\n  Some special test builds will have a test name (the git branch name) prepended,\n  such as fixissue90-2.1.8-beta03.\n\napilevel\n  The string constant '2.0' indicating this module supports DB API level 2.0.\n\nlowercase\n  A Boolean that controls whether column names in result rows are lowercased.\n  This can be changed any time and affects queries executed after the change.\n  The default is False.  This can be useful when database columns have\n  inconsistent capitalization.\n\npooling\n  A Boolean indicating whether connection pooling is enabled.  This is a\n  global (HENV) setting, so it can only be modified before the first\n  connection is made.  The default is True, which enables ODBC connection\n  pooling.\n\nthreadsafety\n  The integer 1, indicating that threads may share the module but not\n  connections.  Note that connections and cursors may be used by different\n  threads, just not at the same time.\n\nqmark\n  The string constant 'qmark' to indicate parameters are identified using\n  question marks."

**Lets check what's inside the pyodbc module**

In [3]:
dir(pyodbc)

['BINARY',
 'Binary',
 'BinaryNull',
 'Connection',
 'Cursor',
 'DATETIME',
 'DataError',
 'DatabaseError',
 'Date',
 'DateFromTicks',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NUMBER',
 'NotSupportedError',
 'OperationalError',
 'ProgrammingError',
 'ROWID',
 'Row',
 'SQLWCHAR_SIZE',
 'SQL_ACCESSIBLE_PROCEDURES',
 'SQL_ACCESSIBLE_TABLES',
 'SQL_ACTIVE_ENVIRONMENTS',
 'SQL_AGGREGATE_FUNCTIONS',
 'SQL_ALTER_DOMAIN',
 'SQL_ALTER_TABLE',
 'SQL_ASYNC_MODE',
 'SQL_ATTR_TXN_ISOLATION',
 'SQL_BATCH_ROW_COUNT',
 'SQL_BATCH_SUPPORT',
 'SQL_BIGINT',
 'SQL_BINARY',
 'SQL_BIT',
 'SQL_BOOKMARK_PERSISTENCE',
 'SQL_CATALOG_LOCATION',
 'SQL_CATALOG_NAME',
 'SQL_CATALOG_NAME_SEPARATOR',
 'SQL_CATALOG_TERM',
 'SQL_CATALOG_USAGE',
 'SQL_CHAR',
 'SQL_COLLATION_SEQ',
 'SQL_COLUMN_ALIAS',
 'SQL_CONCAT_NULL_BEHAVIOR',
 'SQL_CONVERT_FUNCTIONS',
 'SQL_CONVERT_VARCHAR',
 'SQL_CORRELATION_NAME',
 'SQL_CREATE_ASSERTION',
 'SQL_CREATE_CHARACTER_SET',
 'SQL_CREATE_COLLATION',
 'SQL_CREATE_DOMAIN',
 'SQL_CREATE_SCHEMA',
 'SQL_CREATE_TABLE',
 'SQL_CREATE_TRANSLATION',
 'SQL_CREATE_VIEW',
 'SQL_CURSOR_COMMIT_BEHAVIOR',
 'SQL_CURSOR_ROLLBACK_BEHAVIOR',
 'SQL_DATABASE_NAME',
 'SQL_DATA_SOURCE_NAME',
 'SQL_DATA_SOURCE_READ_ONLY',
 'SQL_DATETIME_LITERALS',
 'SQL_DBMS_NAME',
 'SQL_DBMS_VER',
 'SQL_DDL_INDEX',
 'SQL_DECIMAL',
 'SQL_DEFAULT_TXN_ISOLATION',
 'SQL_DESCRIBE_PARAMETER',
 'SQL_DM_VER',
 'SQL_DOUBLE',
 'SQL_DRIVER_HDESC',
 'SQL_DRIVER_HENV',
 'SQL_DRIVER_HLIB',
 'SQL_DRIVER_HSTMT',
 'SQL_DRIVER_NAME',
 'SQL_DRIVER_ODBC_VER',
 'SQL_DRIVER_VER',
 'SQL_DROP_ASSERTION',
 'SQL_DROP_CHARACTER_SET',
 'SQL_DROP_COLLATION',
 'SQL_DROP_DOMAIN',
 'SQL_DROP_SCHEMA',
 'SQL_DROP_TABLE',
 'SQL_DROP_TRANSLATION',
 'SQL_DROP_VIEW',
 'SQL_DYNAMIC_CURSOR_ATTRIBUTES1',
 'SQL_DYNAMIC_CURSOR_ATTRIBUTES2',
 'SQL_EXPRESSIONS_IN_ORDERBY',
 'SQL_FILE_USAGE',
 'SQL_FLOAT',
 'SQL_FORWARD_ONLY_CURSOR_ATTRIBUTES1',
 'SQL_FORWARD_ONLY_CURSOR_ATTRIBUTES2',
 'SQL_GETDATA_EXTENSIONS',
 'SQL_GROUP_BY',
 'SQL_GUID',
 'SQL_IDENTIFIER_CASE',
 'SQL_IDENTIFIER_QUOTE_CHAR',
 'SQL_INDEX_KEYWORDS',
 'SQL_INFO_SCHEMA_VIEWS',
 'SQL_INSERT_STATEMENT',
 'SQL_INTEGER',
 'SQL_INTEGRITY',
 'SQL_INTERVAL_DAY',
 'SQL_INTERVAL_DAY_TO_HOUR',
 'SQL_INTERVAL_DAY_TO_MINUTE',
 'SQL_INTERVAL_DAY_TO_SECOND',
 'SQL_INTERVAL_HOUR',
 'SQL_INTERVAL_HOUR_TO_MINUTE',
 'SQL_INTERVAL_HOUR_TO_SECOND',
 'SQL_INTERVAL_MINUTE',
 'SQL_INTERVAL_MINUTE_TO_SECOND',
 'SQL_INTERVAL_MONTH',
 'SQL_INTERVAL_SECOND',
 'SQL_INTERVAL_YEAR',
 'SQL_INTERVAL_YEAR_TO_MONTH',
 'SQL_KEYSET_CURSOR_ATTRIBUTES1',
 'SQL_KEYSET_CURSOR_ATTRIBUTES2',
 'SQL_KEYWORDS',
 'SQL_LIKE_ESCAPE_CLAUSE',
 'SQL_LONGVARBINARY',
 'SQL_LONGVARCHAR',
 'SQL_MAX_ASYNC_CONCURRENT_STATEMENTS',
 'SQL_MAX_BINARY_LITERAL_LEN',
 'SQL_MAX_CATALOG_NAME_LEN',
 'SQL_MAX_CHAR_LITERAL_LEN',
 'SQL_MAX_COLUMNS_IN_GROUP_BY',
 'SQL_MAX_COLUMNS_IN_INDEX',
 'SQL_MAX_COLUMNS_IN_ORDER_BY',
 'SQL_MAX_COLUMNS_IN_SELECT',
 'SQL_MAX_COLUMNS_IN_TABLE',
 'SQL_MAX_COLUMN_NAME_LEN',
 'SQL_MAX_CONCURRENT_ACTIVITIES',
 'SQL_MAX_CURSOR_NAME_LEN',
 'SQL_MAX_DRIVER_CONNECTIONS',
 'SQL_MAX_IDENTIFIER_LEN',
 'SQL_MAX_INDEX_SIZE',
 'SQL_MAX_PROCEDURE_NAME_LEN',
 'SQL_MAX_ROW_SIZE',
 'SQL_MAX_ROW_SIZE_INCLUDES_LONG',
 'SQL_MAX_SCHEMA_NAME_LEN',
 'SQL_MAX_STATEMENT_LEN',
 'SQL_MAX_TABLES_IN_SELECT',
 'SQL_MAX_TABLE_NAME_LEN',
 'SQL_MAX_USER_NAME_LEN',
 'SQL_MULTIPLE_ACTIVE_TXN',
 'SQL_MULT_RESULT_SETS',
 'SQL_NEED_LONG_DATA_LEN',
 'SQL_NON_NULLABLE_COLUMNS',
 'SQL_NO_NULLS',
 'SQL_NULLABLE',
 'SQL_NULLABLE_UNKNOWN',
 'SQL_NULL_COLLATION',
 'SQL_NUMERIC',
 'SQL_NUMERIC_FUNCTIONS',
 'SQL_ODBC_INTERFACE_CONFORMANCE',
 'SQL_ODBC_VER',
 'SQL_OJ_ALL_COMPARISON_OPS',
 'SQL_OJ_CAPABILITIES',
 'SQL_OJ_FULL',
 'SQL_OJ_INNER',
 'SQL_OJ_LEFT',
 'SQL_OJ_NESTED',
 'SQL_OJ_NOT_ORDERED',
 'SQL_OJ_RIGHT',
 'SQL_ORDER_BY_COLUMNS_IN_SELECT',
 'SQL_PARAM_ARRAY_ROW_COUNTS',
 'SQL_PARAM_ARRAY_SELECTS',
 'SQL_PARAM_INPUT',
 'SQL_PARAM_INPUT_OUTPUT',
 'SQL_PARAM_OUTPUT',
 'SQL_PARAM_TYPE_UNKNOWN',
 'SQL_PC_NOT_PSEUDO',
 'SQL_PC_PSEUDO',
 'SQL_PC_UNKNOWN',
 'SQL_PROCEDURES',
 'SQL_PROCEDURE_TERM',
 'SQL_QUOTED_IDENTIFIER_CASE',
 'SQL_REAL',
 'SQL_RESULT_COL',
 'SQL_RETURN_VALUE',
 'SQL_ROW_UPDATES',
 'SQL_SCHEMA_TERM',
 'SQL_SCHEMA_USAGE',
 'SQL_SCOPE_CURROW',
 'SQL_SCOPE_SESSION',
 'SQL_SCOPE_TRANSACTION',
 'SQL_SCROLL_OPTIONS',
 'SQL_SEARCH_PATTERN_ESCAPE',
 'SQL_SERVER_NAME',
 'SQL_SMALLINT',
 'SQL_SPECIAL_CHARACTERS',
 'SQL_SQL92_DATETIME_FUNCTIONS',
 'SQL_SQL92_FOREIGN_KEY_DELETE_RULE',
 'SQL_SQL92_FOREIGN_KEY_UPDATE_RULE',
 'SQL_SQL92_GRANT',
 'SQL_SQL92_NUMERIC_VALUE_FUNCTIONS',
 'SQL_SQL92_PREDICATES',
 'SQL_SQL92_RELATIONAL_JOIN_OPERATORS',
 'SQL_SQL92_REVOKE',
 'SQL_SQL92_ROW_VALUE_CONSTRUCTOR',
 'SQL_SQL92_STRING_FUNCTIONS',
 'SQL_SQL92_VALUE_EXPRESSIONS',
 'SQL_SQL_CONFORMANCE',
 'SQL_SS_TIME2',
 'SQL_SS_XML',
 'SQL_STANDARD_CLI_CONFORMANCE',
 'SQL_STATIC_CURSOR_ATTRIBUTES1',
 'SQL_STATIC_CURSOR_ATTRIBUTES2',
 'SQL_STRING_FUNCTIONS',
 'SQL_SUBQUERIES',
 'SQL_SYSTEM_FUNCTIONS',
 'SQL_TABLE_TERM',
 'SQL_TIMEDATE_ADD_INTERVALS',
 'SQL_TIMEDATE_DIFF_INTERVALS',
 'SQL_TIMEDATE_FUNCTIONS',
 'SQL_TINYINT',
 'SQL_TXN_CAPABLE',
 'SQL_TXN_ISOLATION_OPTION',
 'SQL_TXN_READ_COMMITTED',
 'SQL_TXN_READ_UNCOMMITTED',
 'SQL_TXN_REPEATABLE_READ',
 'SQL_TXN_SERIALIZABLE',
 'SQL_TYPE_DATE',
 'SQL_TYPE_TIME',
 'SQL_TYPE_TIMESTAMP',
 'SQL_UNION',
 'SQL_UNKNOWN_TYPE',
 'SQL_USER_NAME',
 'SQL_VARBINARY',
 'SQL_VARCHAR',
 'SQL_WCHAR',
 'SQL_WLONGVARCHAR',
 'SQL_WMETADATA',
 'SQL_WVARCHAR',
 'SQL_XOPEN_CLI_YEAR',
 'STRING',
 'Time',
 'TimeFromTicks',
 'Timestamp',
 'TimestampFromTicks',
 'UNICODE_SIZE',
 'Warning',
 '__doc__',
 '__file__',
 '__name__',
 '__package__',
 'apilevel',
 'connect',
 'dataSources',
 'drivers',
 'getDecimalSeparator',
 'lowercase',
 'native_uuid',
 'paramstyle',
 'pooling',
 'setDecimalSeparator',
 'threadsafety',
 'version']

**First lets check our SQL Server driver version**

In [4]:
pyodbc.drivers()

['SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)',
 'SQL Server Native Client 11.0',
 'Microsoft Access dBASE Driver (*.dbf, *.ndx, *.mdx)',
 'ODBC Driver 13 for SQL Server',
 'SQL Server Native Client RDA 11.0',
 'SQL Server Native Client 10.0',
 'PostgreSQL ANSI(x64)',
 'PostgreSQL Unicode(x64)',
 'Amazon Redshift (x64)',
 'MySQL ODBC 8.0 ANSI Driver',
 'MySQL ODBC 8.0 Unicode Driver']

**we'll create a connection to SQL Server**

In [5]:
sql_conn = pyodbc.connect('DRIVER={ODBC Driver 13 for SQL Server};SERVER=DESKTOP-O6725QL;DATABASE=Chinook;Trusted_Connection=yes')

**We'll query the Chinook database:**

**Your task is to create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName. The first five rows of your results should look like this:**

In [6]:
qry = "SELECT * FROM Chinook.dbo.VW_Chinook_qry1 Order By LastName, FirstName"

In [7]:
df = pd.read_sql(qry, sql_conn)

In [8]:
df.head()

  LastName FirstName              Name           Title
0  Almeida   Roberto        Vai Passar  Minha Historia
1  Almeida   Roberto  Morena De Angola  Minha Historia
2  Almeida   Roberto    Meu Caro Amigo  Minha Historia
3  Almeida   Roberto      Mateus Enter  Afrociberdelia
4  Almeida   Roberto     Samba Do Lado  Afrociberdelia

In [9]:
df.tail()

        LastName FirstName                Name                           Title
2235  Zimmermann      Fynn     Nothing to Hide                Heroes, Season 1
2236  Zimmermann      Fynn            Eu E Ela                     Volume Dois
2237  Zimmermann      Fynn       Exodus, Pt. 1  Battlestar Galactica, Season 3
2238  Zimmermann      Fynn  Amanhã Não Se Sabe                     Volume Dois
2239  Zimmermann      Fynn       Sonifera Ilha                     Volume Dois

**The SQL query for the view**

```sql
with songs as (
	SELECT [TrackId]
			,a.[Name] as 'Track_Name'
			,b.Title as 'Album_Title'
			,c.ArtistId
			,c.Name as 'Artist'
	FROM [dbo].[Track] a
	left outer join Album b
		on a.AlbumId = b.AlbumId
	left outer join	 Artist c
		on b.ArtistId = c.ArtistId
)
select LastName
		,FirstName
		,s.Track_Name as 'Name'
		,s.Album_Title as 'Title'
from Customer c 
left outer join Invoice i
	on c.CustomerId = i.CustomerId
left outer join InvoiceLine il
	on i.InvoiceId = il.InvoiceId
left outer join songs s
	on il.TrackId = s.TrackId
```